; domain
(define (domain strips-sliding-tile)

    (:requirements :strips)
    (:predicates (tile ?x) (position ?x) (at ?t ?x ?y) (blank ?x ?y)
                (inc ?p ?pp) (dec ?p ?pp)
    )
    (:action move-up
        :parameters (?ex ?ey ?t ?tx)
        :precondition (and (tile ?t) (position ?ex) (position ?ey) (position ?tx) 
                    (dec ?ex ?tx) (blank ?ex ?ey) (at ?t ?tx ?ey))
        :effect (and (not (blank ?ex ?ey)) (not (at ?t ?tx ?ey))
                    (blank ?tx ?ey) (at ?t ?ex ?ey))
    )
    (:action move-down
        :parameters (?ex ?ey ?t ?tx)
        :precondition (and (tile ?t) (position ?ex) (position ?ey)  (position ?tx)
                    (inc ?ex ?tx) (blank ?ex ?ey) (at ?t ?tx ?ey))
        :effect (and (not (blank ?ex ?ey)) (not (at ?t ?tx ?ey))
                    (blank ?tx ?ey) (at ?t ?ex ?ey))
    )
    (:action move-left
        :parameters (?ex ?ey ?t ?ty)
        :precondition (and (tile ?t) (position ?ex) (position ?ey)  (position ?ty)
                    (dec ?ey ?ty) (blank ?ex ?ey) (at ?t ?ex ?ty))
        :effect (and (not (blank ?ex ?ey)) (not (at ?t ?ex ?ty))
                    (blank ?ex ?ty) (at ?t ?ex ?ey))
    )
    (:action move-right
        :parameters (?ex ?ey ?t ?ty)
        :precondition (and (tile ?t) (position ?ex) (position ?ey)  (position ?ty)
                    (inc ?ey ?ty) (blank ?ex ?ey) (at ?t ?ex ?ty))
        :effect (and (not (blank ?ex ?ey)) (not (at ?t ?ex ?ty))
                    (blank ?ex ?ty) (at ?t ?ex ?ey))
    )
)

; problem
(define (problem hard3)
    (:domain strips-sliding-tile)
    (:objects t1 t2 t3 t4 t5 t6 t7 t8 x1 x2 x3 y1 y2 y3)
    (:init  (tile t1) (tile t2) (tile t3) (tile t4) 
            (tile t5) (tile t6) (tile t7) (tile t8) 
            (position x1) (position x2) (position x3) 
            (position y1) (position y2) (position y3) 
            (inc x1 x2) (inc x2 x3) (dec x3 x2) (dec x2 x1)
            (inc y1 y2) (inc y2 y3) (dec y3 y2) (dec y2 y1)
            (blank x3 y2)
            (at t2 x1 y1) (at t1 x2 y1) (at t7 x3 y1) (at t8 x1 y2) (at t6 x2 y2) 
            (at t3 x1 y3) (at t4 x2 y3) (at t5 x3 y3)
    )
    (:goal  (and (at t1 x1 y1) (at t8 x2 y1) (at t7 x3 y1) (at t2 x1 y2) 
            (at t6 x3 y2) (at t3 x1 y3) (at t4 x2 y3) (at t5 x3 y3))
    )
)

; plan
1. (move-up x3 y2 t6 x2)
   deleted: (blank x3 y2) (at t6 x2 y2)
   added: (blank x2 y2) (at t6 x3 y2)
   goals met: 5 of 8
2. (move-up x2 y2 t8 x1)
   deleted: (blank x2 y2) (at t8 x1 y2)
   added: (blank x1 y2) (at t8 x2 y2)
   goals met: 5 of 8
3. (move-left x1 y2 t2 y1)
   deleted: (blank x1 y2) (at t2 x1 y1)
   added: (blank x1 y1) (at t2 x1 y2)
   goals met: 6 of 8
4. (move-down x1 y1 t1 x2)
   deleted: (blank x1 y1) (at t1 x2 y1)
   added: (blank x2 y1) (at t1 x1 y1)
   goals met: 7 of 8
5. (move-right x2 y1 t8 y2)
   deleted: (blank x2 y1) (at t8 x2 y2)
   added: (blank x2 y2) (at t8 x2 y1)
   goals met: 8 of 8
